cases/ansys_verification/VMFL069/case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| VMFL069 -- Two Phase Poiseuille Flow (VM2026R1 p.205). FROZEN CASE INPUT.  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lowerWall       { type fixedFluxPressure; value uniform 0; }
    upperWall       { type fixedFluxPressure; value uniform 0; }
    periodicIn      { type cyclic; }
    periodicOut     { type cyclic; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
