cases/ansys_verification/VMFL069/case/0/alpha.fluid1
/*--------------------------------*- C++ -*----------------------------------*\
| VMFL069 -- Two Phase Poiseuille Flow (VM2026R1 p.205). FROZEN CASE INPUT.  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.fluid1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    lowerWall       { type zeroGradient; }
    upperWall       { type zeroGradient; }
    periodicIn      { type cyclic; }
    periodicOut     { type cyclic; }
    frontAndBack    { type empty; }
}

// ************************************************************************* //
